Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
        <!-- Speed Limit Slider -->
        <div class='slider-group'>
          <div class='slider-header'>
            <div class='slider-title'>
              <svg class='slider-icon' viewBox='0 0 24 24'><polygon points='13 2 3 14 12 14 11 22 21 10 12 10 13 2'/></svg>
              <span>RC DRIVE VELOCITY</span>
            </div>
            <span class='slider-value' id='val-speed'>78%</span>
          </div>
          <div class='range-input-wrap'>
            <input type='range' id='slide-speed' min='20' max='100' value='78'>
          </div>
        </div>
        
        <!-- Camera Servo Angle Slider -->
        <div class='slider-group'>
          <div class='slider-header'>
            <div class='slider-title'>
              <svg class='slider-icon' viewBox='0 0 24 24'><path d='M1 12s4-8 11-8 11 8 11 8-4 8-11 8-11-8-11-8z'/><circle cx='12' cy='12' r='3'/></svg>
              <span>RADAR DECK SERVO</span>
            </div>
            <span class='slider-value' id='val-servo'>90°</span>
          </div>
          <div class='range-input-wrap'>
            <input type='range' id='slide-servo' min='0' max='180' value='90'>
          </div>
        </div>
      </div>
    </div>
  </section>

  <!-- Gesture Tab Page -->
  <section class='card panel-gesture' id='panel-gesture'>
    <h2 class='card-title'>IMU GESTURE CONTROLLER</h2>
    <div class="joystick-container">
      <div class="imu-visualizer" style="display: flex; justify-content: center; margin: 10px 0; width: 100%;">
        <canvas id="imu-canvas" width="140" height="140" style="background: transparent; border-radius: 50%; display: block;"></canvas>
      </div>
      <div style="display: grid; grid-template-columns: 1fr 1fr; gap: 12px; width: 100%; text-align: center; margin-bottom: 16px;">
        <div class="metric-widget" style="padding: 10px;">
          <span class="metric-label">PITCH TILT</span>
          <span class="metric-value" id="val-pitch">0&deg;</span>
        </div>
        <div class="metric-widget" style="padding: 10px;">
          <span class="metric-label">ROLL TILT</span>
          <span class="metric-value" id="val-roll">0&deg;</span>
        </div>
      </div>
      <button class="btn-horn" id="btn-imu-toggle" onclick="requestOrientationPermission()" style="background: rgba(6, 182, 212, 0.08); border-color: rgba(6, 182, 212, 0.2); color: var(--accent-gesture);">
        START TILT STEERING
      </button>
      <!-- IMU warning shown if browser blocks DeviceOrientation -->
      <div id="imu-warning" style="display:none; text-align:center; padding:12px 14px; background:rgba(244,63,94,0.07); border:1px solid rgba(244,63,94,0.2); border-radius:14px; margin-top:14px; font-size:10px; line-height:1.7; color:var(--accent-danger);">
        &#9888; No IMU events detected.<br>
        Android Chrome blocks sensors on HTTP.<br>
        <b>Fix:</b> Go to <code style="font-size:9px;">chrome://flags</code> &rarr; search <b>Insecure origins</b> &rarr; add <code style="font-size:9px;">http://192.168.4.1</code><br>
        Or use the D-pad below as fallback.
      </div>
      <!-- Fallback D-pad (always visible, works without IMU) -->
      <div style="margin-top:18px;">
        <div style="text-align:center; font-size:9px; font-weight:800; letter-spacing:0.1em; color:var(--text-muted); margin-bottom:10px;">MANUAL FALLBACK PAD</div>
        <div style="display:grid; grid-template-columns:1fr 1fr 1fr; gap:8px; max-width:180px; margin:0 auto;">
          <div></div>
          <button class="dpad-btn" id="dpf" onpointerdown="gestureManual('F')" onpointerup="gestureManual('S')" onpointerleave="gestureManual('S')">&#9650;</button>
          <div></div>
          <button class="dpad-btn" id="dpl" onpointerdown="gestureManual('L')" onpointerup="gestureManual('S')" onpointerleave="gestureManual('S')">&#9668;</button>
          <button class="dpad-btn" id="dps" onpointerdown="gestureManual('S')">&#9632;</button>
          <button class="dpad-btn" id="dpr" onpointerdown="gestureManual('R')" onpointerup="gestureManual('S')" onpointerleave="gestureManual('S')">&#9658;</button>
          <div></div>
          <button class="dpad-btn" id="dpb" onpointerdown="gestureManual('B')" onpointerup="gestureManual('S')" onpointerleave="gestureManual('S')">&#9660;</button>
          <div></div>
        </div>
      </div>
    </div>
  </section>

  <!-- Follow Tab Page -->
  <section class='card panel-follow' id='panel-follow'>
    <h2 class='card-title'>HUMAN TARGET FOLLOWER</h2>
    <div class="oa-status-msg" style="margin-bottom: 16px;">
      The car will dynamically seek out a human at a close distance range (15cm to 50cm).
      The scanning deck tracks the target, steering and driving the car to maintain its distance.
    </div>
    <div class="metrics-container" style="grid-template-columns: 1fr;">
      <div class="metric-widget" style="align-items: center; padding: 20px;">
        <span class="metric-label">TRACKED TARGET DISTANCE</span>
        <span class="metric-value" id="val-follow-dist" style="font-size: 24px; color: var(--accent-follow);">STANDBY</span>
        <div class="gauge-bar-container" style="width: 80%; margin-top: 10px;">
          <div class="gauge-bar" id="follow-gauge" style="width: 0%; background: var(--accent-follow);"></div>
        </div>
      </div>
    </div>
  </section>

</div>
<script>
  let activeCmd = 'S';
  let socket;
  let imuActive = false;
  let imuEventsReceived = false;
  let lastGestureTime = 0;
  
  // Custom throttle to prevent ESP32 network starvation
  const throttle = (func, limit) => {
    let inThrottle;
    return (...args) => {
      const context = this;
      if (!inThrottle) {
        func.apply(context, args);
        inThrottle = true;
        setTimeout(() => inThrottle = false, limit);
      }
    }
  };
  
  // WebSockets setup
  const initWebSocket = () => {
    const wsUrl = 'ws://' + window.location.hostname + ':81/';
    socket = new WebSocket(wsUrl);
    socket.onopen = () => {
      const badge = document.getElementById('conn-badge');
      badge.textContent = 'CONNECTED';
      badge.style.background = 'rgba(16, 185, 129, 0.08)';
      badge.style.color = 'var(--accent-success)';
      badge.style.borderColor = 'rgba(16, 185, 129, 0.2)';
    };
    socket.onclose = () => {
      const badge = document.getElementById('conn-badge');
      badge.textContent = 'OFFLINE';
      badge.style.background = 'rgba(244, 63, 94, 0.08)';
      badge.style.color = 'var(--accent-danger)';
      badge.style.borderColor = 'rgba(244, 63, 94, 0.2)';
      setTimeout(initWebSocket, 2000);
    };
    socket.onmessage = (event) => {
      try {
        const data = JSON.parse(event.data);
        updateTelemetryUI(data);
      } catch(e) {}
    };
  };
  
  // Primary WS communication with HTTP fallbacks
  const sendSpeed = throttle((val) => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('speed:' + val);
    } else {
      fetch('/speed?v=' + val).catch(() => {});
    }
  }, 100);
  
  const sendServo = throttle((val) => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('servo:' + val);
    } else {
      fetch('/servo?a=' + val).catch(() => {});
    }
  }, 80);
  
  const sendCmd = (cmd) => {
    if (cmd !== activeCmd) {
      activeCmd = cmd;
      if (socket && socket.readyState === WebSocket.OPEN) {
        socket.send('cmd:' + cmd);
      } else {
        fetch('/cmd?d=' + cmd).catch(() => {});
      }
      const names = { F: 'FORWARD', B: 'REVERSE', L: 'LEFT', R: 'RIGHT', FL: 'FWD-LEFT', FR: 'FWD-RIGHT', BL: 'REV-LEFT', BR: 'REV-RIGHT', S: 'STOP' };
      document.getElementById('val-cmd').textContent = names[cmd] || 'STOP';
      
