Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
      const vGauge = document.getElementById('vector-gauge');
      if (cmd === 'S') {
        vGauge.style.width = '20%';
        vGauge.style.background = 'var(--text-muted)';
      } else {
        vGauge.style.width = '100%';
        vGauge.style.background = 'var(--accent-active)';
      }
    }
  };
  
  const sendGestureCmd = (cmd, speed) => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('g:' + cmd + ':' + speed);
    }
  };
  
  // Virtual Joystick Logic
  const handle = document.getElementById('joy-handle');
  const joyBase = handle.parentElement;
  let isDragging = false;
  let startX = 0, startY = 0;
  const maxDistance = 45; // max displacement boundary (px)
  
  const initJoystick = () => {
    joyBase.addEventListener('pointerdown', (e) => {
      e.preventDefault();
      isDragging = true;
      joyBase.setPointerCapture(e.pointerId);
      
      const rect = joyBase.getBoundingClientRect();
      startX = rect.left + rect.width / 2;
      startY = rect.top + rect.height / 2;
      
      updateJoyPos(e.clientX, e.clientY);
    });
    
    joyBase.addEventListener('pointermove', (e) => {
      if (!isDragging) return;
      e.preventDefault();
      updateJoyPos(e.clientX, e.clientY);
    });
    
    const endDrag = (e) => {
      if (!isDragging) return;
      isDragging = false;
      joyBase.releasePointerCapture(e.pointerId);
      
      handle.style.transform = 'translate(0px, 0px)';
      sendCmd('S');
    };
    
    joyBase.addEventListener('pointerup', endDrag);
    joyBase.addEventListener('pointercancel', endDrag);
  };
  
  const updateJoyPos = (clientX, clientY) => {
    let dx = clientX - startX;
    let dy = clientY - startY;
    
    const distance = Math.sqrt(dx * dx + dy * dy);
    if (distance > maxDistance) {
      dx = (dx / distance) * maxDistance;
      dy = (dy / distance) * maxDistance;
    }
    
    handle.style.transform = `translate(${dx}px, ${dy}px)`;
    
    const nx = dx / maxDistance;
    const ny = -dy / maxDistance;
    
    let cmd = 'S';
    const deadzone = 0.35;
    
    if (Math.abs(nx) < deadzone && Math.abs(ny) < deadzone) {
      cmd = 'S';
    } else {
      const angle = Math.atan2(ny, nx) * 180 / Math.PI;
      
      if (angle >= -22.5 && angle < 22.5) {
        cmd = 'R';
      } else if (angle >= 22.5 && angle < 67.5) {
        cmd = 'FR';
      } else if (angle >= 67.5 && angle < 112.5) {
        cmd = 'F';
      } else if (angle >= 112.5 && angle < 157.5) {
        cmd = 'FL';
      } else if (angle >= 157.5 || angle < -157.5) {
        cmd = 'L';
      } else if (angle >= -157.5 && angle < -112.5) {
        cmd = 'BL';
      } else if (angle >= -112.5 && angle < -67.5) {
        cmd = 'B';
      } else if (angle >= -67.5 && angle < -22.5) {
        cmd = 'BR';
      }
    }
    sendCmd(cmd);
  };
  initJoystick();
  
  // Horn Button Touch/Pointer listeners
  const horn = document.getElementById('btn-horn');
  const hornStart = (e) => {
    e.preventDefault();
    horn.classList.add('active');
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('horn:1');
    } else {
      fetch('/horn?on=1').catch(() => {});
    }
  };
  
  const hornEnd = (e) => {
    e.preventDefault();
    horn.classList.remove('active');
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('horn:0');
    } else {
      fetch('/horn?on=0').catch(() => {});
    }
  };
  
  horn.addEventListener('pointerdown', hornStart);
  horn.addEventListener('pointerup', hornEnd);
  horn.addEventListener('pointerleave', hornEnd);
  
  // Sliders Input Bindings
  const speedSlider = document.getElementById('slide-speed');
  const speedVal = document.getElementById('val-speed');
  speedSlider.addEventListener('input', () => {
    const txt = speedSlider.value + '%';
    speedVal.textContent = txt;
    sendSpeed(speedSlider.value);
  });
  
  speedSlider.addEventListener('change', () => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('speed:' + speedSlider.value);
    } else {
      fetch('/speed?v=' + speedSlider.value).catch(() => {});
    }
  });
  
  const servoSlider = document.getElementById('slide-servo');
  const servoVal = document.getElementById('val-servo');
  servoSlider.addEventListener('input', () => {
    const txt = servoSlider.value + '°';
    servoVal.textContent = txt;
    sendServo(servoSlider.value);
  });
  
  const servoSliderChange = () => {
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('servo:' + servoSlider.value);
    } else {
      fetch('/servo?a=' + servoSlider.value).catch(() => {});
    }
  };
  servoSlider.addEventListener('change', servoSliderChange);
  
  // Mode Selection Tabs Switcher
  const changeMode = (mode) => {
    if (mode !== 'gesture' && imuActive) {
      stopOrientationListener();
    }
    syncModeTab(mode);
    if (socket && socket.readyState === WebSocket.OPEN) {
      socket.send('mode:' + mode);
    } else {
      fetch('/set?mode=' + mode).catch(() => {});
    }
  };
  
  const syncModeTab = (mode) => {
    const container = document.querySelector('.app-container');
    const selector = document.querySelector('.mode-selector');
    const tabs = ['oa', 'rc', 'gesture', 'follow'];
    
    tabs.forEach(t => {
      document.getElementById('tab-' + t).classList.remove('active');
      document.getElementById('panel-' + t).classList.remove('active');
    });
    
    document.getElementById('tab-' + mode).classList.add('active');
    document.getElementById('panel-' + mode).classList.add('active');
    
    selector.className = 'mode-selector';
    if (mode === 'rc') {
      selector.classList.add('rc-active');
      container.className = 'app-container theme-rc';
    } else if (mode === 'gesture') {
      selector.classList.add('gesture-active');
      container.className = 'app-container theme-gesture';
      drawImuIndicator(0, 0);
    } else if (mode === 'follow') {
      selector.classList.add('follow-active');
      container.className = 'app-container theme-follow';
    } else {
      container.className = 'app-container theme-oa';
    }
  };
  
  // Telemetry updates
  const updateTelemetryUI = (data) => {
    // Distance Lidar
    const distVal = document.getElementById('val-dist');
    const distBar = document.getElementById('dist-gauge');
    if (data.dist >= 999) {
      distVal.textContent = 'CLEAR';
      distVal.className = 'metric-value status-safe';
      distBar.style.width = '100%';
      distBar.style.background = 'var(--accent-success)';
    } else {
      distVal.textContent = data.dist + ' cm';
      const pct = Math.min(Math.max(data.dist, 0), 100);
      distBar.style.width = pct + '%';
      if (data.dist > 50) {
        distVal.className = 'metric-value status-safe';
        distBar.style.background = 'var(--accent-success)';
      } else if (data.dist > 30) {
        distVal.className = 'metric-value status-warning';
        distBar.style.background = '#f59e0b';
      } else {
        distVal.className = 'metric-value status-danger';
        distBar.style.background = 'var(--accent-danger)';
      }
    }
    
