Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
    // Cliff IR
    const cliffVal = document.getElementById('val-cliff');
    const cliffBar = document.getElementById('cliff-gauge');
    if (data.ir < 1600) {
      cliffVal.textContent = 'CLIFF!';
      cliffVal.className = 'metric-value status-danger';
      cliffBar.style.width = '20%';
      cliffBar.style.background = 'var(--accent-danger)';
    } else {
      cliffVal.textContent = 'SAFE';
      cliffVal.className = 'metric-value status-safe';
      cliffBar.style.width = '100%';
      cliffBar.style.background = 'var(--accent-success)';
    }
    
    // Follow Mode telemetries
    const followVal = document.getElementById('val-follow-dist');
    const followBar = document.getElementById('follow-gauge');
    if (data.mode === 'follow') {
      if (data.dist >= 999) {
        followVal.textContent = 'SEEKING...';
        followVal.style.color = 'var(--text-muted)';
        followBar.style.width = '0%';
      } else {
        followVal.textContent = data.dist + ' cm';
        followVal.style.color = 'var(--accent-active)';
        const fPct = Math.min(Math.max((data.dist - 15) / (50 - 15) * 100, 0), 100);
        followBar.style.width = fPct + '%';
      }
    }
    
    // Update radar sweeps target trackers
    currentAngle = data.angle;
    
    // Push target readings to decay array
    addRadarTarget(data.angle, data.dist);
    addRadarTarget(150, data.dL);
    addRadarTarget(90, data.dC);
    addRadarTarget(30, data.dR);
    
    // Sync mode tab selection
    const tabs = ['oa', 'rc', 'gesture', 'follow'];
    const activeTab = tabs.find(t => document.getElementById('tab-' + t).classList.contains('active'));
    if (data.mode !== activeTab) {
      syncModeTab(data.mode);
    }
  };
  
  const fetchTelemetry = () => {
    fetch('/status')
      .then(res => res.json())
      .then(data => {
        const badge = document.getElementById('conn-badge');
        badge.textContent = 'CONNECTED';
        badge.style.background = 'rgba(16, 185, 129, 0.08)';
        badge.style.color = 'var(--accent-success)';
        badge.style.borderColor = 'rgba(16, 185, 129, 0.2)';
        updateTelemetryUI(data);
      })
      .catch(() => {
        if (!socket || socket.readyState !== WebSocket.OPEN) {
          const badge = document.getElementById('conn-badge');
          badge.textContent = 'OFFLINE';
          badge.style.background = 'rgba(244, 63, 94, 0.08)';
          badge.style.color = 'var(--accent-danger)';
          badge.style.borderColor = 'rgba(244, 63, 94, 0.2)';
        }
      });
  };
  
  // Canvas radar renderer logic
  const canvas = document.getElementById('radar-canvas');
  const ctx = canvas.getContext('2d');
  const cx = canvas.width / 2;
  const cy = canvas.height / 2;
  const maxR = 90; // maximum range scale radius (px)
  
  let currentAngle = 90;
  let targetSpots = []; // holds target markers {angle, dist, life}
  
  const addRadarTarget = (angle, dist) => {
    if (dist <= 0 || dist >= 100) return;
    const radAngle = angle;
    const existing = targetSpots.find(t => Math.abs(t.angle - radAngle) < 15);
    if (existing) {
      existing.dist = dist;
      existing.life = 1.0;
    } else {
      targetSpots.push({ angle: radAngle, dist: dist, life: 1.0 });
    }
  };
  
  const renderRadar = () => {
    ctx.clearRect(0, 0, canvas.width, canvas.height);
    
    // Outer scope radial backing
    ctx.beginPath();
    ctx.arc(cx, cy, maxR, 0, 2 * Math.PI);
    ctx.fillStyle = 'rgba(16, 185, 129, 0.012)';
    ctx.fill();
    
    // Grid circles
    ctx.strokeStyle = 'rgba(16, 185, 129, 0.12)';
    ctx.lineWidth = 1;
    ctx.setLineDash([4, 4]);
    [30, 60, 90].forEach(rVal => {
      ctx.beginPath();
      ctx.arc(cx, cy, (rVal / 100) * maxR, 0, 2 * Math.PI);
      ctx.stroke();
    });
    
    // Crosshairs lines
    ctx.setLineDash([]);
    ctx.strokeStyle = 'rgba(16, 185, 129, 0.06)';
    ctx.beginPath();
    ctx.moveTo(cx - maxR, cy);
    ctx.lineTo(cx + maxR, cy);
    ctx.moveTo(cx, cy - maxR);
    ctx.lineTo(cx, cy + maxR);
    ctx.stroke();
    
    // Field of view lines (Left and Right bounds: 30deg and 150deg)
    ctx.strokeStyle = 'rgba(16, 185, 129, 0.04)';
    [30, 150].forEach(deg => {
      const rad = deg * Math.PI / 180;
      ctx.beginPath();
      ctx.moveTo(cx, cy);
      ctx.lineTo(cx + maxR * Math.cos(rad), cy - maxR * Math.sin(rad));
      ctx.stroke();
    });
    
    // Dynamic active theme color determination
    const container = document.querySelector('.app-container');
    let rgbColor = '16, 185, 129';
    if (container.classList.contains('theme-rc')) rgbColor = '99, 102, 241';
    else if (container.classList.contains('theme-gesture')) rgbColor = '6, 182, 212';
    else if (container.classList.contains('theme-follow')) rgbColor = '168, 85, 247';
    
    // Sensor flashlight sweeping cone (16deg width)
    const beamAngle = currentAngle * Math.PI / 180;
    const beamGrad = ctx.createRadialGradient(cx, cy, 0, cx, cy, maxR);
    beamGrad.addColorStop(0, `rgba(${rgbColor}, 0.2)`);
    beamGrad.addColorStop(0.3, `rgba(${rgbColor}, 0.06)`);
    beamGrad.addColorStop(1, `rgba(${rgbColor}, 0)`);
    
    ctx.fillStyle = beamGrad;
    ctx.beginPath();
    ctx.moveTo(cx, cy);
    ctx.arc(cx, cy, maxR, -beamAngle - (8 * Math.PI/180), -beamAngle + (8 * Math.PI/180));
    ctx.closePath();
    ctx.fill();
    
    // Sweeping beam centerline indicator
    ctx.strokeStyle = `rgba(${rgbColor}, 0.4)`;
    ctx.lineWidth = 1.5;
    ctx.beginPath();
    ctx.moveTo(cx, cy);
    ctx.lineTo(cx + maxR * Math.cos(beamAngle), cy - maxR * Math.sin(beamAngle));
    ctx.stroke();
    
    // Decay update & draw warning markers
    targetSpots.forEach(t => t.life -= 0.012);
    targetSpots = targetSpots.filter(t => t.life > 0);
    targetSpots.forEach(t => {
      const r = (t.dist / 100) * maxR;
      const rAngle = t.angle * Math.PI / 180;
      const tx = cx + r * Math.cos(rAngle);
      const ty = cy - r * Math.sin(rAngle);
      
      // Warning obstacle glow ring
      ctx.beginPath();
      ctx.arc(tx, ty, 4, 0, 2 * Math.PI);
      ctx.fillStyle = `rgba(244, 63, 94, ${t.life})`;
      ctx.shadowColor = '#f43f5e';
      ctx.shadowBlur = 8;
      ctx.fill();
      ctx.shadowBlur = 0;
      
