Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
  // Start WebSocket Server
  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
  
  beep(100);
  Serial.println("System initialized. HTTP & WebSocket servers running.");
}
// ─────────────────────────────────────────────────────────────
//  LOOP
// ─────────────────────────────────────────────────────────────
void loop() {
  server.handleClient();   // Always handle incoming HTTP requests
  webSocket.loop();        // Keep the WebSocket server listening
  
  // Update servo angle safely in loop context
  if (carMode == MODE_OA) {
    aimServo(TURN_ANGLE_C, false);
  } else if (carMode == MODE_RC || carMode == MODE_GESTURE) {
    aimServo(rcServoAngle, false);
  }
  
  // Broadcast WebSocket telemetry at 150ms intervals
  static unsigned long lastWsTelemetry = 0;
  if (millis() - lastWsTelemetry > 150) {
    lastWsTelemetry = millis();
    String modeStr = "oa";
    if (carMode == MODE_RC) modeStr = "rc";
    else if (carMode == MODE_GESTURE) modeStr = "gesture";
    else if (carMode == MODE_FOLLOW) modeStr = "follow";
    
    String json = "{";
    json += "\"mode\":\"" + modeStr + "\",";
    json += "\"dist\":" + String(lastDistance) + ",";
    json += "\"angle\":" + String(currentServoAngle) + ",";
    json += "\"ir\":" + String(lastIR) + ",";
    json += "\"dL\":" + String(dL_dist) + ",";
    json += "\"dC\":" + String(dC_dist) + ",";
    json += "\"dR\":" + String(dR_dist);
    json += "}";
    webSocket.broadcastTXT(json);
  }
  
  if (carMode == MODE_OA) {
    // ── Obstacle Avoidance (Autopilot Mode) ───────────────────
    long dC = distanceCM();
    int ir = analogRead(IR_PIN);
    lastDistance = dC;
    lastIR = ir;
    dC_dist = dC; // Update center distance for radar
    // Edge/cliff protection
    if (ir < IR_THRESHOLD) {
      stopAll(); beep(60);
      reverse(OA_REVERSE); delay(REVERSE_MS);
      int dir = chooseBestTurn();
      (dir > 0) ? pivotLeft(OA_TURN) : pivotRight(OA_TURN);
      delay(PIVOT_MS); stopAll();
      return;
    }
    // Ultrasonic collision avoidance
    if (dC <= SAFE_DIST_CM) {
      stopAll(); beep(60);
      reverse(OA_REVERSE); delay(REVERSE_MS); stopAll();
      int dir = chooseBestTurn();
      (dir > 0) ? pivotLeft(OA_TURN) : pivotRight(OA_TURN);
      delay(PIVOT_MS); stopAll();
    } else {
      int spd = (dC >= CLEAR_DIST_CM) ? OA_SPEED : OA_SPEED * 3 / 4;
      forward(spd);
    }
    delay(20);
  } else if (carMode == MODE_RC) {
    // ── RC Web Control Mode ──────────────────────────────────
    // Buzzer control
    digitalWrite(BUZZER, rcHornOn ? HIGH : LOW);
    // Apply motor drive commands
    applyRcCmd(rcCmd, rcSpeed);
    // Update telemetry parameters asynchronously in the background
    static unsigned long lastSensorUpdate = 0;
    if (millis() - lastSensorUpdate > 150) {
      lastSensorUpdate = millis();
      lastDistance = singlePingCM(15000UL); // Single ping with 15ms timeout (approx 250cm range)
      lastIR = analogRead(IR_PIN);
    }
    delay(15);
  } else if (carMode == MODE_GESTURE) {
    // ── Gesture Control Mode (Direct WS inputs control drive) ──
    // Buzzer control
    digitalWrite(BUZZER, rcHornOn ? HIGH : LOW);
    // Update telemetry parameters asynchronously in the background
    static unsigned long lastSensorUpdate = 0;
    if (millis() - lastSensorUpdate > 150) {
      lastSensorUpdate = millis();
      lastDistance = singlePingCM(15000UL);
      lastIR = analogRead(IR_PIN);
    }
    delay(15);
  } else if (carMode == MODE_FOLLOW) {
    // ── Human Following Mode ──────────────────────────────────
    unsigned long now = millis();
    if (now - lastFollowTime > 80) { // run logic at ~12Hz
      lastFollowTime = now;
      
      if (!followFound) {
        // Stop the car while searching
        stopAll();
        // Sweep search - use aimServo with wait=true so servo settles before reading
        followAngle += followSweepDir;
        if (followAngle >= 135) {
          followAngle = 135;
          followSweepDir = -6;
        } else if (followAngle <= 45) {
          followAngle = 45;
          followSweepDir = 6;
        }
        aimServo(followAngle, true); // wait=true gives 150ms for servo to settle
        
        long d = singlePingCM(25000UL); // 25ms timeout ~425cm max range
        lastDistance = d;
        if (d >= 5 && d <= 70) {  // widened: catches targets at 5-70cm
          followFound = true;
          beep(50);
          lostFollowTime = now;
        }
      } else {
        // Target is found — read distance with servo already at followAngle
        aimServo(followAngle, false);
        delay(80); // brief settle before read
        long d = singlePingCM(25000UL);
        lastDistance = d;
        
        if (d >= 5 && d <= 70) {
          lostFollowTime = now;
          dC_dist = d;
          
          // Micro-scan ±8° to find direction target moved
          aimServo(constrain(followAngle + 8, 45, 135), false);
          delay(60);
          long dL_f = singlePingCM(20000UL);
          
          aimServo(constrain(followAngle - 8, 45, 135), false);
          delay(60);
          long dR_f = singlePingCM(20000UL);
          
          aimServo(followAngle, false);
          
          // Adjust servo angle to keep target centered
          if (dL_f < d && dL_f < dR_f && dL_f >= 5) {
            followAngle = constrain(followAngle + 5, 45, 135);
          } else if (dR_f < d && dR_f < dL_f && dR_f >= 5) {
            followAngle = constrain(followAngle - 5, 45, 135);
          }
          
          // Steer motors based on servo angle
          if (followAngle > 105) {
            pivotLeft(OA_TURN * 8 / 10);
          } else if (followAngle < 75) {
            pivotRight(OA_TURN * 8 / 10);
          } else {
            // Target centred — control distance
            if (d > 35) {
              forward(OA_SPEED);       // too far  → chase
            } else if (d < 12) {
              reverse(OA_REVERSE);     // too close → back off
            } else {
              stopAll();               // sweet spot 12-35 cm
            }
          }
        } else {
          stopAll();
          if (now - lostFollowTime > 1500) {
            followFound = false;
            followAngle = TURN_ANGLE_C;
          }
        }
      }
    }
  }
}
